[
"Gosh, you know, I really like pie.",
"It's pie for me, guys!",
"All I really know for sure is that nothing picks me up like a nice piece of pie.",
"Pie? You bet!",
"I think that pie may be one of the best foods we have.</p><p>No, wait, <i>the</i> best food we have.",
"Me, when I'm feeling down, I like some pie.",
"I don't know about all this stuff, guys, but I do know that I like pie.",
"Who can argue with pie? Not me.",
"That all may be so, but I notice that you didn't say anything about pie.",
"Peach, strawberry, apple, blueberry, pecan, even mincemeat, they're all damned good. Because they're <i>pies</i>.",
"It may look like I talk about pies a lot, but I'm actually restraining myself from bringing them up more often. They're <i>that</i> good!",
"Pie. Pie. Pie. Pie.</p><p>Ever notice how totally great that word sounds?",
"That's great. Anyone have any pie?",
"That's total crap. <i>My</i> mother made the best apple pie.",
"I just ate some pie, and darned if I don't want some more already.",
"I'd just like to say that I agree with all the positive comments made about pie. It's a pleasure being around commenters who have their heads on straight and really know what pie is all about.",
"Excuse the language, but goddamn! Pie is good!",
"When all is said and done, pie is still excellent.",
"Churchill liked pie, you know. And not that Ward guy. The other one, the British guy, he liked pies.",
"I'm not really sure why I like pies so much. The roundness? The delicious crust? I dunno, man, I dunno.",
"I like pie. A lot.",
"Pies suck!</p><p>Ha ha, I'm joking, of course. Pies RULE!!",
"You guys don't mention pie enough.",
"For God loves us so, he gave us pie.",
"Imagine a world without pie. Sad, isn't it?",    
"OT: Pie!",
"Getting back on topic: Pie is not only delicious, it's round, too!",
"I thought we were talking about pie?",
"You can have your cakes, petit fors, and tarts. For me it's pie, or nothing at all!",
"Your comment reminds me, I could really use some pie!",
"If we're not talking about pie, I don't want any part of it.",
"I don't want to live in a world without pie.",
"Q: What's round, brown and full of hot steamy goodness?<br><br>A: <b>PIE!</b>",
"So, if it comes to that, and I'm not saying it will, but if it does, <i>what about the pie</i>?",
"I think you misunderstand; I'm really talking about pie.",
"Pie!",
"Give me pie lots of pie / 'neath the starry skies above / Don't fence me in - without pie, that is.",
"I pledge allegiance <i>to pie!</i>",
"Ever see \"American Pie\"? That's how much I like pie.",
"What's hot, moist, and crusty around the edges? Pie!",
"It doesn't always have to be steamy you know. Some cold pies can be excellent as well!",
"In the beginning, there was pie. Praise Jesus!",
"This is a fascinating topic, but I have to go now. The pie is ready.",
"The sad part is that this entire controversy could end right here, if we could all sit down and share some pie!",
"PIE! I EAT IT!",
"You can learn more about pie, <a href='http://en.wikipedia.org/wiki/Pie'>here</a>!",
"Bottom-crust-only pies may be known as tarts or tartlets.",
"\"Pieing\" can result in injury to the target and assault or more serious charges against the pie throwers. Don't throw pies!",
"Whether or not what we experienced was an According to Hoyle miracle is insignificant. What is significant is that I smelled pie. Pie was involved.",
"Pie is the cornerstone of any nutritious breakfast.",
"Your ideas intrigue me. Would you care to discuss them with me over pie?",
"Sweet Home Ala<i>bama</i> but I could use me some pie!",
"Remember <i>Warrant</i>? That was a good band. Any band with a song about pie knows what's important.",
"I'd kick a nun in the crotch for a slice of sweet pie right about now.", 
"I couldn't possibly eat another piece of pie. Oh wait a minute, yes I can!", 
"Humble Pie was one of Peter Frampton's early bands. I don't know if they had songs about pie or not. I will assume they did.",
"I often dream of pie when I'm alone.",
"I think that I shall never spy, a poem as lovely as a pie.",
"And in the end, the pies we ate were equal to the pies we baked.",
"Stick a fork in me, fellas, I'm done - like a pie!",
"Ain't no place I'd rather be, than with a pie 'neath a shady tree.",
"If you like to eat pie and you think I'm sexy, come on sugar, let me know!",
"OK, I admit I wasn't paying attention back there - I was too busy eating pie.",
"I wouldn't mind a one party state. As long as there's pie.",
"Holy crap! I'm almost out of pie!",
"Set the controls for the heart of the pie!",
"Stick your thumb, deep in that pie. Pull it out, stick it in your eye.",
"I'm on the highway to pie. And I'm going down. All the way.",
"Give me your apple, your rhubarb, your dark and sticky pecan, yearning to be eaten.",
"She was a pie-making machine, she kept her roller clean, she made the best damn mincemeat that I've ever eaten.",
"It puts the apples in the pie crust, or else it gets the hose again.",
"The pie of Freedom is baked in Liberty's oven and filled with the Flesh of many good Men. Also.",
"It is not sufficient that I must have my pie. I must eat it, too.",
"That's a difficult question. I wonder what the Pillsbury dough boy would do?",
"It's hard to take this seriously, given your apparent indifference to the greatest food of all time: pie.",
"On the matter of fried pies, I am torn. They do resemble, in some ways, the true (that is, baked) pie, but the speed at which they are created suggests to me that the preparer is more interested in the rapidity of production, rather than in the quality of the end result. Therefore, I feel that a fried pie is less of a pie than a bald simulacrum: a cheat, an impostor, a substitute. Which is not to say they are not delicious, of course.",
"Why is pie better than other desserts, like, for example, cake? Well, it has to do with the way the crust gets.... BECAUSE SHUT UP!! THAT'S WHY!!!!",
"Let's talk about pie, baby<br>Let's talk about you and me<br>Let's talk about all the good pies<br>And the bad pies that may be.",
"\"Bye, bye. Miss American Pie.\" That's the saddest line I've ever heard.",
"While my wife was out of town, our rabbi's wife borrowed a fancy pie pan. It was returned a few days later filled with an apple pie. When my wife asked where the pie came from, I told her it was baked by our rabbi's wife, who said she never returns something without filling it up.<br><br>\"Good, you should let her borrow our checkbook,\" she replied.",
"Apple, peaches pumpkin pie, who's not ready holler 'I'.",
"Trolls like pie. But we like trolling, too. It's not an either/or thing.",
"My name is Little Debbie, baker to kings:<br>Look upon my pies, ye Mighty, and despair!",
"It was clever, was it not, of the universe to name, after pie, the constant which ties the radius of a pie (the side of a slice) to the circumference of the pie (the number of inches of foil you'll need to cover the edge after the first 15 minutes) ? Well, I think it's clever, anyway.",
"I think I just threw up in my mouth a little bit. Luckily, it was pie!",
"When in the Course of human events, it becomes necessary for one people to dissolve the political bands which have connected them with another, it is best to serve pie.",
"Jack be nimble, Jack be quick... no, no... Peter Piper picked a... no, that's not it either. What's the one about pie?",
"Honey pie you are making me crazy. I'm in love but I'm lazy. So won't you please come home.",
"Gimme a P! Gimme an I! Gimme an E! What's it spell? PIE!",
"Your custard pie, yeah, sweet and nice. When you cut it, mama, save me a slice!",
"Well, yeah. But things would be different if there was pie.",
"Q: What do you get when you cut a jack o'lantern by its diameter?<br>A: Pumpkin Pi!",
"When I'm bad, I don't get any pie. When I'm really bad, I don't get my juicebox, either. But I miss the pie the most.",
"Look! Up in the sky! It's a cake, it's a cookie, it's pie!",
"Global warming is the result of millions of righteous bakers baking millions of delicious pies for the blessed to eat as they await the coming of the lord.",
"I'll be right back - I think the pie is ready.",
"Please, quit your complaining. The pie will be ready shortly.",
"The pie of liberty is glazed with the sugar of freedom!",
"You know what goes great with the Tea Of Freedom? Pie!",
"Keep the government out of my pie!",
"A well fed Militia, being necessary to the security of a free State, the right of the people to keep and bake Pies, shall not be infringed.",
"I blame pie.",
"Obama promised me a pie, but all I got was this lousy job.",
"Sarah Palin came over last night, and we ate her famous moose pie.",
"Have you ever loved a woman so much it hurts you deep inside? That's how I feel about pie.",
"PIE! That's why!",
"It was a dark and crusty pie...",
"Oh right. You liberals are just so smart and clever, aren't you? Well, if you're so smart, why don't you have any pie? Answer that, libtards!",
"PiePiePiePiePiePiePiePie!",
"No, I don't think I will stop talking about pie.",
"There are two kinds of people in this world: those with pie, and those without. I know who I prefer.",
"There once was a man from Nantucket<br>Whose pie was so moist he would...",
"<img src='http://ok-cleek.com/images/pumpkinpie.jpg'>",
"A pie is a baked dish which is usually made of a pastry dough casing that covers or completely contains a filling of various sweet or savoury ingredients. Pies can be either \"filled\", where a dish is covered by pastry and the filling is placed on top of that, \"top-crust,\" where the filling is placed in a dish and covered with a pastry/potato mash top before baking, or \"two-crust,\" with the filling completely enclosed in the pastry shell. Pies can be a variety of sizes, ranging from bite-size to ones designed for multiple servings.",
"The first pies appeared around 9500 BC, in the Egyptian Neolithic period or New Stone Age, when the use of stone tools shaped by polishing or grinding became common, the domestication of plants and animals, the establishment of permanent villages, and the practice of crafts such as pottery and weaving.",
"The fattest knight at King Arthur's round table was Sir Cumference. He acquired his size from too much pi.",
"Pie's gone. I blame Obama.",
"I'd gladly pay you never for some pie right now.",
"Just give me some pie, round beautiful pie! shining, steaming, gleaming flaxen waxen.",
"Bubba's mama baked pie, and her mama before her baked pie, and her mama before her mama baked pie, too.",
"I'm not a smart man....but I know what pie is.",
"The pie abides. I don't know about you but I take comfort in that.",
"Blessed are the piemakers.",
"One thing only I know, and that is that I know pie.",
"An unexamined pie is not worth eating.",
"I can believe anything, provided it is pie.",
"I have always depended on the kindness of pie.",
"If it be a sin to covet pie, I am the most offending soul.",
"Everything has been figured out, except how to live without pie.",
"I arise in the morning torn between a desire to improve the world and a desire to eat pie. This makes it hard to plan the day.",
"Maybe all one can do is hope to end up with the right kind of pie.",
"That's a big goal of mine, to try and grow as much of my own pie as possible.",
"Two pies are in the oven, and one pie says to the other pie, \"Are they really going to eat us?\" and the other pie says, \"OH MY GOD A TALKING PIE!\"",
"It's ok to eat pie 'cause it don't have any feelings.",
"The thing's hollow-it goes on forever–and–oh my God-it's full of pies!",
"Welly, welly, welly, welly, welly, welly, well. To what do I owe the extreme pleasure of this surprising pie?",
"Appy-polly-loggies. I had something of a pain in my gulliver so I had to eat some pie.",
"Oh bliss! Bliss and heaven! Oh, it was gorgeousness and gorgeousity made pie. It was like a bird of rarest-spun heaven metal or like silvery wine flowing in a spaceship, gravity all nonsense now. As I slooshied, I ate such lovely pies!",
"In theory, there is no difference between theory and pie. But, in practice, there is.",
"I find that when I do not think of pie I do not think at all.",
"Uuummmm, this is a tasty pie. Mind if I have some of your tasty beverage to wash this down with?",
"Ashes to ashes, funk to funky, we know Major Tom's a pie junky.",
"Revenge is a dish best served with pie!",
"I used to think the way you do. Really, I did. But then I learned about pie. And now everything else seems pointless.",
"The pie was so much better under Bush!",
"Hey did you know that Saint Ivan is Rila is the Patron Saint of Pies and Pie Makers and it is said that \"two pies Ivan\" will always provide for makers of pies as thanks to the poor pie maker who gave his last two pies to the Saint? No? Well now you do!",
"Bake the pie higher",
"Pie rationing will be necessary. Also, time for higher cost per slice for the wealthy. The wealthy are receiving 3x the amount of pie dollars that they put in. And if they want their second dollop of whipped cream, then by gum, they can pay for it!",
"Hey baby, take a walk on the crusty side of life - let's go in on a pie together.",
"I've... seen things you people wouldn't believe; blueberry pies cooling on flight consoles off the shoulder of Orion; I've smelled apple pies baking in ship's ovens near the Tannhauser Gate. All those... moments... will be lost... in time, like... tears... in rain.",
"Picture yourself on a boat on a river, with pie.",
"<blink>PIE</blink>",
"She's got a ticket for pie, but she don't care. My baby don't care!",
"So... crusty!",
"All pies are equal, but some are more equal than others.",
"No more pie? The horror, the horror!",
"Pie is the only thing in the world that amounts to anything.",
"Well, here's another nice pie you've gotten me into!",
"Uneasy lies the head that wears a pie.",
"Broadly speaking, the short words are the best, and the best short word is 'pie'.",
"What's this? I seem to be submerged in some sort of deep gooey substance surrounded by a flaky crust.",
"Nothing beats a chunky wodge of pie when the comments start to heat up.",
"Seriously, pie! Why would a food so ubiquitous make me so excited?",
"Yeah so I pretty much think pie is the greatest thing ever invented to put in one's mouth.",
"This little pie went to market, and this little pie stayed home. This little pie had fruit filling, and this little pie had none. And THIS little pie went wee-wee-wee all the way home!",
"I like to eat pie. And I want to rub it on my face.",
"You know what divine intervention means? It's when God comes down from Heaven and makes a beeyoutiful pie.",
"Sawdust pie has a funny name but a great flavor. It's easy for me to make because my head is full of sawdust.",
"I just want to say one word to you. Are you listening? PIE.",
"It's like I was playing some kind of game, but the rules don't make any sense to me. They're being made up by all the wrong people. I mean no one makes them up. They seem to make only pie.",
"Pie. Okay? Pie.If I ever see a pie on a bed in this house, man, like you'll never see me again. I'm gone. ",
"Most people don't know how they're gonna feel from one moment to the next. But a pie fiend has a pretty good idea. All you gotta do is look at the labels on the little pies.",
"You know, with all that makeup and pie and stuff, I actually thought I was SMART for a second.",
"Great spirits have always encountered violent opposition from mediocre pies.",
"The great question that has never been answered, and which I have not yet been able to answer, despite my thirty years of research into the pie soul, is \"What does a pie want?\"",
"After climbing a great pie, one only finds that there are many more pies to climb.",
"I am confined only by the pies I bake myself.",
"If you don't know where you are going any pie will take you there.",
"I'll try any pie once, twice if I like it, three times to make sure.",
"Now and then it's good to pause in our pursuit of happiness and just be happy with pie.",
"There are only four questions of value in life, Don Octavio. What is sacred? Of what is the pie made? What is worth living for, and what is worth dying for? The answer to each is the same: only pie.",
"Always eat pie when you can; it is cheap medicine.",
"Intelligence without pie is a bird without wings.",
"The trick is to enjoy pie. Don't waste away your days waiting for better pie ahead.",
"Love pie first, and everything else falls into line.",
"You live but once, you might as well eat pie.",
"Oh the places you'll go! There is fun to be done! There are points to be scored! There are games to be won! And the magical things you can do with that pie will make you the winning-est winner of all.",
"Don't go around saying the world owes you a pie. The world owes you nothing. It was here first.",
"It does not matter how slowly you go as long as you do not stop eating pie.",
"Pie continues to ruin my life.",
"The secret of pie is honesty and fair dealing. If you can fake that, you've got it made.",
"A heart is not judged by how much you love pie; but by how much your pie is loved by others.",
"Sometimes I can hear my bones straining under the weight of all the pies I'm not eating.",
"The pie that fits one person pinches another; there is no recipe for pie that suits all cases.",
"Do you feel that apple pies need a good handful of cinnamon to make them work? Or are you ok with just caramelizing them and using the natural sugars?",
"Store-bought crusts are fine with me. But for the love of sweet gooey Jesus, do not serve me pie made with canned filling!",
"Do they like pie in Syria? Probably not.",
"If you can't be with the pie you love, honey, love the pie you're with. Doo doo doo doo, doo-doo dee-dit!",
"You can have my original-formula Pyrex pie dish when you pry it from my cold dead hands!",
"Here I am trying to teach you ignorant losers about the wonders of pie and all I get in return are insults!",
"Pie rules my life!",
"I am the pie in the sky, looking at you. I can read your mind.",
"Pre-baking the bottom crust is necessary if you want to avoid a doughy bottom. Not eating pie at all helps avoid a different kind of doughy bottom.",
"3.1415926535897932384626433832795...",
"Pie pie pie. Pie, pie pie.",
"Picture yourself on a boat with some pie.",
"Donald Trump makes the best pie. Beuatiful pie. The best. You'll love it.",
"Hillary Clinton made a pie, but Donald Trump ate it."
]